import React from "react";
import "./begin.css";
import img from "./488003-336819.jpg"
import brain from "./WhatsApp Image 2023-12-08 at 9.49.39 PM.jpeg"

const Begin = () => {
  return (
    <div className="begin-container">
        <div className="begin-img">
          <img src={img} alt=""/>
        </div>
        <div>
          <p>مرحبًا بك في موقعنا المخصص لقياس جانب الانتباه لدى الأطفال الذين يعانون من صعوبات في التعلم. يتيح لك ه
              ذا الموقع تجربة فريدة تركز على تقدير
              مستوى انتباه الطفل وفحص قدرته على التركيز. يعتمد الموقع على مراحل تتم مرورها بترتيب مدروس، مما يسمح للطفل بتحسين مهاراته تدريجيًا
              بعد كل محاولة، وذلك من خلال تحديات مصممة بعناية. اكتشف الإمكانيات الكامنة لديهم وساعدهم على تحقيق تقدم ملحوظ في رحلتهم التعليمية.
              إضافةً إلى ذلك، يقوم الموقع بتسجيل وتحليل نتائج كل محاولة، مما يوفر
              للأهل والمعلمين رؤية شاملة حول أداء الطفل وتطوره في جوانب الانتباه. يستفيد المستخدمون من تقارير دقيقة وإحصائيات مفيدة تعزز فهمهم لاحتياجات 
              الطفل وتوجيههم نحو الدعم الأمثل. نهدف من خلال هذا الموقع إلى تعزيز تجربة التعلم للأطفال ذوي صعوبات في التعل
              م، وتوفير أدوات فعّالة لتحسين قدراتهم في جوانب الانتباه والتركيز.
          </p>
        </div>
        <div className="goals-container">
          <div className="goals-img">
            <img src={brain} />
          </div>
          <div>
            <h2 className="goals">:أهداف الموقع</h2>
            <ul>
              <li>
                تقديم تقييم شامل: قدم تقييمًا شاملاً لمستوى انتباه الأطفال الذين يعانون من صعوبات في التعلم، مما يمكّن الأهل والمعلمين من فهم أفضل لاحتياجاتهم.
              </li>
              <li>
                  توفير تدريب متقدم: قدم تحديات ومهام متقدمة تعزز من مهارات الانتباه والتركيز للأطفال، مع تقديم تجارب تعلم ممتعة وفعّالة.
              </li>
              <li>
                تحليل الأداء: سجّل وحلّل نتائج كل محاولة لتوفير إحصائيات دقيقة تعكس تطور الأداء على مر الوقت، مما يمكّن من تحديد المجالات التي تحتاج إلى تركيز إضافى.
              </li>
              <li>
                تمكين الأهل والمعلمين: قدم معلومات مفيدة وتقارير فورية للأهل والمعلمين، مما يمكّنهم من اتخاذ قرارات تعليمية مستنيرة وتوجيه الدعم بشكل فعّال.
              </li>
              <li>
                تعزيز تجربة التعلم: سعينا لتحسين تجربة التعلم للأطفال ذوي صعوبات في التعلم من خلال توفير أدوات فعّالة ومحفزة لتعزيز تفاعلهم الإيجابي مع العملية التعليمية.
              </li>
            </ul>
          </div>
        </div>
        <div>
          <h2 className="goals">:مميزات الموقع</h2>
          <ul>
            <li>
              سهولة الاستخدام :لضمان قابلية الموقع للأطفال والكبار على حد سواء، مع توفير تجربة تفاعلية فعّالة.
            </li>
            <li>
              تعزيز التعاون الأكاديمي: ساهم في تعزيز التعاون بين المؤسسات التعليمية والمجتمع، من خلال توفير أدوات تقييمية تُسهم في فحص ودعم طلاب ذوي صعوبات في التعلم.
            </li>
            <li>
              تقدمية: يقدم مراحل تقدمية تمر بها الأطفال بترتيب، مما يسمح بتطوير المهارات بشكل تدريجي وفعّال.
            </li>
            <li>
              المرونة في الاستخدام: قدم خيارات متنوعة لتكييف التحديات والمحتوى وفقًا لاحتياجات وقدرات كل طفل، مما يعزز المرونة ويتيح لكل فرد الاستفادة بشكل أفضل.
            </li>
            <li>
              تحديات متنوعة: يقدم تحديات ومهام متنوعة تعتمد على أساليب تعلم مختلفة لتناسب احتياجات الأطفال المتنوعة.
            </li>
            <li>
              وجيه للمراجعة الاستمرارية: تيسير تجربة المراجعة الاستمرارية لنتائج التقييم.
            </li>
          </ul>
        </div>
        <a href="/game" >
          <button className="game-btn">ابدأ اللعب</button>
        </a>
    </div>
  ) 
}

export default Begin;
